Repository: Puremag1c/ChatFilter
Catalog: src/chatfilter/i18n/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Session '{session_id}' has no api_id configured. Please configure api_id before connecting.
ru: Сессия '{session_id}' не имеет настроенного api_id. Пожалуйста, настройте api_id перед подключением.

source: Session '{session_id}' has no api_hash configured. Please configure api_hash before connecting.
ru: Сессия '{session_id}' не имеет настроенного api_hash. Пожалуйста, настройте api_hash перед подключением.

source: Session '{session_id}' has no proxy configured. Please configure a proxy for this session before connecting.
ru: Сессия '{session_id}' не имеет настроенного прокси. Пожалуйста, настройте прокси для этой сессии перед подключением.

source: Session '{session_id}' requires proxy '{proxy_id}' which is not found in proxy pool. Please add the proxy to the pool or update the session configuration.
ru: Сессия '{session_id}' требует прокси '{proxy_id}', который не найден в пуле прокси. Пожалуйста, добавьте прокси в пул или обновите конфигурацию сессии.

source: %(num)d second
ru: %(num)d секунда

source: %(num)d minute
ru: %(num)d минута

source: %(num)d hour
ru: %(num)d час

source: Your session has expired. Please log in again with a new session file.
ru: Ваша сессия истекла. Пожалуйста, войдите снова с новым файлом сессии.

source: Your session has expired or been revoked. Please log in again with a new session file.
ru: Ваша сессия истекла или была отозвана. Пожалуйста, войдите снова с новым файлом сессии.

source: Your session has been logged out from another device. Please upload a new session file.
ru: Ваша сессия была завершена с другого устройства. Пожалуйста, загрузите новый файл сессии с этого устройства.

source: This session is being used on another device. Please use a unique session file.
ru: Эта сессия используется на другом устройстве. Пожалуйста, используйте уникальный файл сессии.

source: Authentication failed. Please verify your session and try again.
ru: Ошибка аутентификации. Пожалуйста, проверьте вашу сессию и попробуйте снова.

source: Your Telegram account has been deactivated. Please contact Telegram support.
ru: Ваш аккаунт Telegram был деактивирован. Пожалуйста, обратитесь в поддержку Telegram.

source: Your Telegram account has been banned. Please contact Telegram support.
ru: Ваш аккаунт Telegram был заблокирован. Пожалуйста, обратитесь в поддержку Telegram.

source: Access to this chat is restricted. You may have been removed or the chat was deleted.
ru: Доступ к этому чату ограничен. Возможно, вас удалили или чат был удалён.

source: This channel is private. You need an invite link to access it.
ru: Этот канал приватный. Вам нужна пригласительная ссылка для доступа.

source: This chat is restricted and cannot be accessed.
ru: Этот чат ограничен и недоступен.

source: You have been banned from this channel.
ru: Вы заблокированы в этом канале.

source: You have been banned from this chat.
ru: Вы заблокированы в этом чате.

source: This action requires administrator privileges.
ru: Это действие требует прав администратора.

source: You don't have permission to send messages in this chat.
ru: У вас нет прав для отправки сообщений в этот чат.

source: Slow mode is enabled in this chat. Please wait before sending another message.
ru: В этом чате включен медленный режим. Пожалуйста, подождите перед отправкой следующего сообщения.

source: Network connection error. Please check your internet connection and try again.
ru: Ошибка сетевого подключения. Пожалуйста, проверьте интернет-соединение и попробуйте снова.

source: Request timed out. Please try again.
ru: Время ожидания запроса истекло. Пожалуйста, попробуйте снова.

source: Failed to connect to Telegram servers. Please check your connection and try again.
ru: Не удалось подключиться к серверам Telegram. Пожалуйста, проверьте соединение и попробуйте снова.

source: The file has been migrated to another data center. Please try again.
ru: Файл был перемещён в другой дата-центр. Пожалуйста, попробуйте снова.

source: Network migration in progress. Please try again in a moment.
ru: Выполняется миграция сети. Пожалуйста, попробуйте снова через некоторое время.

source: Your account is being migrated to another data center. Please try again.
ru: Ваш аккаунт переносится в другой дата-центр. Пожалуйста, попробуйте снова.

source: Statistics are being migrated to another data center. Please try again.
ru: Статистика переносится в другой дата-центр. Пожалуйста, попробуйте снова.

source: Telegram server request failed. Please try again.
ru: Запрос к серверу Telegram не удался. Пожалуйста, попробуйте снова.

source: Telegram server encountered an error. Please try again.
ru: На сервере Telegram произошла ошибка. Пожалуйста, попробуйте снова.

source: Invalid username. Please check the username and try again.
ru: Неверное имя пользователя. Пожалуйста, проверьте и попробуйте снова.

source: Username not found. Please verify the username is correct.
ru: Имя пользователя не найдено. Пожалуйста, проверьте правильность.

source: Invalid invite link. The link may have expired or been revoked.
ru: Неверная пригласительная ссылка. Срок действия ссылки мог истечь или она была отозвана.

source: This invite link has expired. Please request a new invite link.
ru: Срок действия этой пригласительной ссылки истёк. Пожалуйста, запросите новую.

source: Chat or user not found. The ID may be incorrect or the chat may have been deleted.
ru: Чат или пользователь не найден. ID может быть неверным или чат был удалён.

source: Invalid chat ID. The chat may have been deleted or is not accessible.
ru: Неверный ID чата. Чат мог быть удалён или недоступен.

source: Message not found. It may have been deleted.
ru: Сообщение не найдено. Возможно, оно было удалено.

source: File upload failed. Please try uploading the file again.
ru: Ошибка загрузки файла. Пожалуйста, попробуйте загрузить файл снова.

source: File reference has expired. Please try again.
ru: Срок действия ссылки на файл истёк. Пожалуйста, попробуйте снова.

source: Invalid phone number format. Please check the number and try again.
ru: Неверный формат номера телефона. Пожалуйста, проверьте номер и попробуйте снова.

source: Invalid verification code. Please check the code and try again.
ru: Неверный код подтверждения. Пожалуйста, проверьте код и попробуйте снова.

source: Verification code has expired. Please request a new code.
ru: Срок действия кода подтверждения истёк. Пожалуйста, запросите новый код.

source: Incorrect password. Please try again.
ru: Неверный пароль. Пожалуйста, попробуйте снова.

source: Two-factor authentication is enabled. Please provide your password.
ru: Включена двухфакторная аутентификация. Пожалуйста, введите пароль.

source: No changes were made. The data is already up to date.
ru: Изменения не внесены. Данные уже актуальны.

source: Message was not modified. The content is the same as before.
ru: Сообщение не изменено. Содержимое такое же, как прежде.

source: You are already a member of this chat.
ru: Вы уже являетесь участником этого чата.

source: This action cannot be performed by bots.
ru: Это действие не может быть выполнено ботами.

source: Upload a new session file from your Sessions page
ru: Загрузите новый файл сессии со страницы «Сессии»

source: Upload a different session file that isn't being used elsewhere
ru: Загрузите другой файл сессии, который не используется в другом месте

source: Verify your session file is valid or upload a new one
ru: Проверьте, что файл сессии действителен, или загрузите новый

source: Contact Telegram support to reactivate your account
ru: Обратитесь в поддержку Telegram для восстановления аккаунта

source: Contact Telegram support to appeal your ban
ru: Обратитесь в поддержку Telegram для обжалования блокировки

source: Try a different chat or check your Telegram app to verify membership
ru: Попробуйте другой чат или проверьте в приложении Telegram, что вы участник

source: Request an invite link from the channel admin or try a different chat
ru: Запросите пригласительную ссылку у администратора канала или попробуйте другой чат

source: Contact the chat administrator or try a different chat
ru: Свяжитесь с администратором чата или попробуйте другой чат

source: Contact the channel admin to appeal or select a different channel
ru: Свяжитесь с администратором канала для обжалования или выберите другой канал

source: Contact the chat admin to appeal or select a different chat
ru: Свяжитесь с администратором чата для обжалования или выберите другой чат

source: Request admin privileges or perform this action as an admin
ru: Запросите права администратора или выполните это действие как администратор

source: Request write permissions from chat admin or skip this chat
ru: Запросите права на запись у администратора чата или пропустите этот чат

source: Wait for the specified duration before trying again
ru: Подождите указанное время перед повторной попыткой

source: Check your internet connection and click 'Retry'
ru: Проверьте интернет-соединение и нажмите «Повторить»

source: Check your connection speed and click 'Retry'
ru: Проверьте скорость соединения и нажмите «Повторить»

source: Verify your internet connection is stable and click 'Retry'
ru: Убедитесь, что интернет-соединение стабильно, и нажмите «Повторить»

source: Click 'Retry' - this should resolve automatically
ru: Нажмите «Повторить» — это должно разрешиться автоматически

source: Wait a moment and click 'Retry'
ru: Подождите немного и нажмите «Повторить»

source: Click 'Retry' - migration will complete automatically
ru: Нажмите «Повторить» — миграция завершится автоматически

source: Wait a few moments and click 'Retry'
ru: Подождите несколько секунд и нажмите «Повторить»

source: Verify the username format is correct (e.g., @username)
ru: Проверьте правильность формата имени пользователя (например, @username)

source: Double-check the username spelling or try a different username
ru: Перепроверьте написание имени пользователя или попробуйте другое

source: Request a new invite link or verify the link is correct
ru: Запросите новую пригласительную ссылку или проверьте правильность текущей

source: Request a new invite link from the chat admin
ru: Запросите новую пригласительную ссылку у администратора чата

source: Verify the chat ID or try accessing the chat by username instead
ru: Проверьте ID чата или попробуйте получить доступ по имени пользователя

source: Check the chat ID is correct or try accessing by username
ru: Проверьте правильность ID чата или попробуйте доступ по имени пользователя

source: The message may have been deleted - try refreshing the chat
ru: Сообщение могло быть удалено — попробуйте обновить чат

source: Re-upload the file or try a different file
ru: Загрузите файл заново или попробуйте другой файл

source: Click 'Retry' to refresh the file reference
ru: Нажмите «Повторить», чтобы обновить ссылку на файл

source: Verify phone number format includes country code (e.g., +1234567890)
ru: Проверьте, что номер телефона включает код страны (например, +1234567890)

source: Check the verification code from Telegram and try again
ru: Проверьте код подтверждения из Telegram и попробуйте снова

source: Request a new verification code and try again
ru: Запросите новый код подтверждения и попробуйте снова

source: Verify your two-factor authentication password and try again
ru: Проверьте пароль двухфакторной аутентификации и попробуйте снова

source: Provide your two-factor authentication password to continue
ru: Введите пароль двухфакторной аутентификации для продолжения

source: No action needed - the data is already up to date
ru: Действие не требуется — данные уже актуальны

source: No action needed - the message content is unchanged
ru: Действие не требуется — содержимое сообщения не изменилось

source: No action needed - you are already a member
ru: Действие не требуется — вы уже участник

source: This operation is not available for bot accounts
ru: Эта операция недоступна для бот-аккаунтов

source: Rate limit exceeded. Please wait %(duration)s before trying again.
ru: Превышен лимит запросов. Пожалуйста, подождите %(duration)s перед повторной попыткой.

source: Wait %(duration)s and then click 'Retry'
ru: Подождите %(duration)s и нажмите «Повторить»

source: Rate limit exceeded. Please wait before trying again.
ru: Превышен лимит запросов. Пожалуйста, подождите перед повторной попыткой.

source: Wait a few minutes and then click 'Retry'
ru: Подождите несколько минут и нажмите «Повторить»

source: Slow mode is enabled. Please wait %(duration)s before sending another message.
ru: Включен медленный режим. Пожалуйста, подождите %(duration)s перед отправкой следующего сообщения.

source: Wait %(duration)s before trying again
ru: Подождите %(duration)s перед повторной попыткой

source: Slow mode is enabled. Please wait before sending another message.
ru: Включен медленный режим. Пожалуйста, подождите перед отправкой следующего сообщения.

source: Wait for the slow mode cooldown before trying again
ru: Подождите окончания времени ожидания медленного режима перед повторной попыткой

source: Try a different chat or verify your access permissions
ru: Попробуйте другой чат или проверьте права доступа

source: Check your input and try again with correct information
ru: Проверьте введённые данные и попробуйте снова с правильной информацией

source: Wait a few minutes and click 'Retry'
ru: Подождите несколько минут и нажмите «Повторить»

source: Try again or contact support if the issue persists
ru: Попробуйте снова или обратитесь в поддержку, если проблема сохраняется

source: Access denied. You may have been banned or removed from this chat.
ru: Доступ запрещён. Возможно, вас заблокировали или удалили из этого чата.

source: Access to this resource is restricted.
ru: Доступ к этому ресурсу ограничен.

source: Chat or user not found. Please verify the information is correct.
ru: Чат или пользователь не найден. Пожалуйста, проверьте правильность информации.

source: An error occurred: %(error_class)s. Please try again or contact support if the issue persists.
ru: Произошла ошибка: %(error_class)s. Пожалуйста, попробуйте снова или обратитесь в поддержку, если проблема сохраняется.

source: Skip to main content
ru: Перейти к основному содержимому

source: Main navigation
ru: Главная навигация

source: Manage your Telegram session files
ru: Управление Telegram сессиями

source: Sessions
ru: Сессии

source: Select chats to analyze from your Telegram account
ru: Выберите чаты для анализа из вашего Telegram аккаунта

source: Chats
ru: Чаты

source: Import a list of chats from a file or Google Sheets
ru: Импорт списка чатов из файла или Google Sheets

source: Import
ru: Импорт

source: View analysis results and export data
ru: Просмотр результатов анализа и экспорт данных

source: Results
ru: Результаты

source: Browse your past analysis history
ru: Просмотр истории анализов

source: History
ru: История

source: Manage proxy servers for Telegram sessions
ru: Управление прокси-серверами для сессий Telegram

source: Proxies
ru: Прокси

source: Shows your internet connection status
ru: Показывает статус интернет-соединения

source: Online
ru: В сети

source: Toggle dark mode
ru: Переключить тёмную тему

source: Switch between light and dark theme
ru: Переключение между светлой и тёмной темой

source: Switch language
ru: Сменить язык

source: Switch between English and Russian
ru: Переключение между английским и русским языками

source: Export diagnostic information for troubleshooting
ru: Экспорт диагностической информации для устранения неполадок

source: Export Diagnostics
ru: Экспорт диагностики

source: Import Chat List
ru: Импорт списка чатов

source: Upload a file or enter a Google Sheets URL to import a list of chats for analysis
ru: Загрузите файл или введите URL Google Sheets для импорта списка чатов для анализа

source: Import Source
ru: Источник импорта

source: Upload a file containing a list of chats to analyze
ru: Загрузите файл со списком чатов для анализа

source: Upload File
ru: Загрузить файл

source: Upload a text file with one chat per line, or a CSV/Excel file with chat usernames, links, or IDs.
ru: Загрузите текстовый файл с одним чатом на строку, или CSV/Excel файл с именами пользователей, ссылками или ID чатов.

source: Upload chat list file
ru: Загрузить файл списка чатов

source: Select chat list file
ru: Выберите файл списка чатов

source: Select a .txt, .csv, or .xlsx file with chat usernames, links, or IDs
ru: Выберите .txt, .csv или .xlsx файл с именами пользователей, ссылками или ID чатов

source: Supported file formats
ru: Поддерживаемые форматы файлов

source: Upload and parse the selected file
ru: Загрузить и обработать выбранный файл

source: Upload in progress
ru: Загрузка выполняется

source: Import chats from a public Google Sheets document
ru: Импорт чатов из публичного документа Google Sheets

source: Enter a link to a public Google Sheets document. The sheet must be shared with \"Anyone with the link\".
ru: Введите ссылку на публичный документ Google Sheets. Документ должен быть открыт для всех по ссылке.

source: Import chat list from Google Sheets
ru: Импорт списка чатов из Google Sheets

source: Enter the full URL of a public Google Sheets document
ru: Введите полный URL публичного документа Google Sheets

source: Fetch and import chats from the Google Sheets URL
ru: Получить и импортировать чаты по URL Google Sheets

source: Fetch Sheet
ru: Получить таблицу

source: Imported Chats
ru: Импортированные чаты

source: Import a file or Google Sheet to see the list of chats
ru: Импортируйте файл или Google Sheet, чтобы увидеть список чатов

source: Loading imported chats...
ru: Загрузка импортированных чатов...

source: File Format Examples
ru: Примеры форматов файлов

source: Text File (.txt)
ru: Текстовый файл (.txt)

source: CSV File (.csv)
ru: CSV файл (.csv)

source: Select Chats
ru: Выбор чатов

source: Select Chats for Analysis
ru: Выбор чатов для анализа

source: Choose which chats you want to analyze
ru: Выберите чаты для анализа

source: Session
ru: Сессия

source: Select Telegram session
ru: Выберите Telegram сессию

source: Select Telegram session to load chats
ru: Выберите Telegram сессию для загрузки чатов

source: Choose a Telegram session to load your chats and groups
ru: Выберите Telegram сессию для загрузки ваших чатов и групп

source: Select a session
ru: Выберите сессию

source: Chat list
ru: Список чатов

source: Select a session above to load chats
ru: Выберите сессию выше для загрузки чатов

source: Loading chats...
ru: Загрузка чатов...

source: Analysis History
ru: История анализов

source: Browse and view your past chat analyses
ru: Просмотр и изучение ваших прошлых анализов чатов

source: Total
ru: Всего

source: Completed
ru: Завершено

source: Failed
ru: Ошибка

source: Cancelled
ru: Отменено

source: Timeout
ru: Таймаут

source: Filter by status
ru: Фильтр по статусу

source: Filter by analysis status
ru: Фильтр по статусу анализа

source: All Analyses
ru: Все анализы

source: Loading history...
ru: Загрузка истории...

source: No Analysis History
ru: Нет истории анализов

source: You haven't run any analyses yet. Start analyzing your chats to see results here.
ru: Вы ещё не запускали анализы. Начните анализировать чаты, чтобы увидеть результаты здесь.

source: Start Analysis
ru: Начать анализ

source: Previous page
ru: Предыдущая страница

source: Previous
ru: Назад

source: Page
ru: Страница

source: of
ru: из

source: Next page
ru: Следующая страница

source: Next
ru: Далее

source: Proxy Pool
ru: Пул прокси

source: Proxy List
ru: Список прокси

source: Add new proxy
ru: Добавить прокси

source: Add Proxy
ru: Добавить прокси

source: Error
ru: Ошибка

source: Failed to load proxies. Please refresh the page.
ru: Не удалось загрузить прокси. Пожалуйста, обновите страницу.

source: List of configured proxies
ru: Список настроенных прокси

source: Loading proxies...
ru: Загрузка прокси...

source: Name
ru: Имя

source: My Proxy
ru: Мой прокси

source: Proxy name for identification
ru: Имя прокси для идентификации

source: Type
ru: Тип

source: Select proxy type
ru: Выберите тип прокси

source: Host
ru: Хост

source: Proxy server hostname or IP address
ru: Имя хоста или IP-адрес прокси-сервера

source: Port
ru: Порт

source: Proxy server port number
ru: Номер порта прокси-сервера

source: Username (optional)
ru: Имя пользователя (опционально)

source: Leave empty if not required
ru: Оставьте пустым, если не требуется

source: Proxy authentication username
ru: Имя пользователя для аутентификации прокси

source: Password (optional)
ru: Пароль (опционально)

source: Proxy authentication password
ru: Пароль для аутентификации прокси

source: Cancel
ru: Отмена

source: Save
ru: Сохранить

source: Edit Proxy
ru: Редактировать прокси

source: Save Changes
ru: Сохранить изменения

source: This field is required
ru: Это поле обязательно

source: Minimum length is
ru: Минимальная длина:

source: characters
ru: символов

source: Maximum length is
ru: Максимальная длина:

source: Minimum value is
ru: Минимальное значение:

source: Maximum value is
ru: Максимальное значение:

source: Host cannot contain spaces
ru: Хост не может содержать пробелы

source: Please fix the errors in the form
ru: Пожалуйста, исправьте ошибки в форме

source: Validation Error
ru: Ошибка валидации

source: Operation failed
ru: Операция не удалась

source: Proxy updated successfully
ru: Прокси успешно обновлён

source: Proxy added successfully
ru: Прокси успешно добавлен

source: Proxy Updated
ru: Прокси обновлён

source: Proxy Added
ru: Прокси добавлен

source: Save Failed
ru: Ошибка сохранения

source: Delete Proxy
ru: Удалить прокси

source: This proxy is used by
ru: Этот прокси используется

source: session(s). They will be blocked. Continue?
ru: сессиями. Они будут заблокированы. Продолжить?

source: Delete
ru: Удалить

source: Proxy deleted successfully
ru: Прокси успешно удалён

source: Proxy Deleted
ru: Прокси удалён

source: Deletion Failed
ru: Ошибка удаления

source: Analysis Results
ru: Результаты анализа

source: View and export your chat analysis results
ru: Просмотр и экспорт результатов анализа чатов

source: Analysis statistics
ru: Статистика анализа

source: Copy all statistics
ru: Копировать всю статистику

source: %(count)s chats analyzed
ru: %(count)s чатов проанализировано

source: Chats Analyzed
ru: Чатов проанализировано

source: Total messages
ru: Всего сообщений

source: Total Messages
ru: Всего сообщений

source: Unique authors
ru: Уникальных авторов

source: Unique Authors
ru: Уникальных авторов

source: Active chats in last 7 days
ru: Активных чатов за последние 7 дней

source: Active (7d)
ru: Активные (7д)

source: Clock Skew Detected
ru: Обнаружено расхождение времени

source: Your system clock appears to be incorrect, which may affect time-based calculations (messages per hour, history length).
ru: Системные часы могут быть неточными, что может повлиять на расчёты, связанные со временем (сообщений в час, длительность истории).

source: %(count)s chat(s) affected:
ru: %(count)s чатов затронуто:

source: System clock is %(minutes)s minutes ahead of Telegram server time
ru: Системные часы опережают время сервера Telegram на %(minutes)s минут

source: System clock is %(minutes)s minutes behind Telegram server time
ru: Системные часы отстают от времени сервера Telegram на %(minutes)s минут

source: Please check your system time settings and synchronize with a reliable time server (e.g., NTP).
ru: Пожалуйста, проверьте настройки системного времени и синхронизируйтесь с надёжным сервером времени (например, NTP).

source: Result filters
ru: Фильтры результатов

source: Search chats
ru: Поиск чатов

source: Search chats...
ru: Поиск чатов...
