Repository: Puremag1c/ChatFilter
Catalog: src/chatfilter/i18n/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Needs 2FA Password
ru: Требуется пароль 2FA

source: Enter API Credentials
ru: Введите учётные данные API

source: Get credentials at my.telegram.org
ru: Получите учётные данные на my.telegram.org

source: Enter Verification Code
ru: Введите код подтверждения

source: Code
ru: Код

source: Enter the 5-6 digit code sent to your phone
ru: Введите 5-6 значный код, отправленный на ваш телефон

source: Enter 2FA Password
ru: Введите пароль 2FA

source: Password
ru: Пароль

source: Enter your 2FA password
ru: Введите ваш пароль 2FA

source: Submit
ru: Отправить

source: Verify
ru: Проверить

source: Session '{name}' reconnected successfully
ru: Сессия '{name}' успешно переподключена
