Repository: Puremag1c/ChatFilter
Catalog: src/chatfilter/i18n/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Search chats by title or username
ru: Поиск чатов по названию или имени пользователя

source: Filter by chat type
ru: Фильтр по типу чата

source: All Types
ru: Все типы

source: Private
ru: Личный

source: Group
ru: Группа

source: Supergroup
ru: Супергруппа

source: Channel
ru: Канал

source: Forum
ru: Форум

source: Filter by activity
ru: Фильтр по активности

source: Filter by activity status
ru: Фильтр по статусу активности

source: All Activity
ru: Вся активность

source: Inactive
ru: Неактивный

source: Clear all filters
ru: Очистить все фильтры

source: Clear Filters
ru: Очистить фильтры

source: Number of active filters
ru: Количество активных фильтров

source: Copy selected rows
ru: Копировать выбранные строки

source: Copy Selected
ru: Копировать выбранные

source: Compare selected chats
ru: Сравнить выбранные чаты

source: Compare Selected
ru: Сравнить выбранные

source: Export results to CSV file
ru: Экспорт результатов в CSV файл

source: Export CSV
ru: Экспорт CSV

source: Analysis results table
ru: Таблица результатов анализа

source: Chat analysis results
ru: Результаты анализа чатов

source: Select all chats
ru: Выбрать все чаты

source: Sort by chat name
ru: Сортировать по названию чата

source: Chat
ru: Чат

source: Sort by chat type
ru: Сортировать по типу чата

source: Sort by message count
ru: Сортировать по количеству сообщений

source: Messages
ru: Сообщения

source: Sort by author count
ru: Сортировать по количеству авторов

source: Authors
ru: Авторы

source: Sort by history hours
ru: Сортировать по часам истории

source: History (h)
ru: История (ч)

source: Sort by messages per hour
ru: Сортировать по сообщениям в час

source: Msg/Hour
ru: Сообщ/час

source: Sort by activity status
ru: Сортировать по статусу активности

source: Activity
ru: Активность

source: Copy
ru: Копировать

source: Select %(title)s
ru: Выбрать %(title)s

source: Username
ru: Имя пользователя

source: Chat type: %(type)s
ru: Тип чата: %(type)s

source: %(count)s messages
ru: %(count)s сообщений

source: %(count)s authors
ru: %(count)s авторов

source: %(hours)s hours
ru: %(hours)s часов

source: %(rate)s messages per hour
ru: %(rate)s сообщений в час

source: Active in last 7 days
ru: Активен за последние 7 дней

source: Active
ru: Активный

source: Copy row data
ru: Копировать данные строки

source: Compare Chat Metrics
ru: Сравнить метрики чатов

source: Copy comparison data
ru: Копировать данные сравнения

source: Copy Data
ru: Копировать данные

source: Close comparison modal
ru: Закрыть окно сравнения

source: No analysis results yet.
ru: Пока нет результатов анализа.

source: Telegram Sessions
ru: Telegram сессии

source: Telegram Accounts
ru: Telegram аккаунты

source: Manage your Telegram sessions for chat analysis
ru: Управление сессиями Telegram для анализа чатов

source: Accounts
ru: Аккаунты

source: Add new account
ru: Добавить аккаунт

source: Add Account
ru: Добавить аккаунт

source: Failed to load accounts. Please refresh the page.
ru: Не удалось загрузить аккаунты. Пожалуйста, обновите страницу.

source: List of Telegram accounts
ru: Список Telegram аккаунтов

source: Loading accounts...
ru: Загрузка аккаунтов...

source: Add Telegram Account
ru: Добавить Telegram аккаунт

source: Close modal
ru: Закрыть окно

source: Phone Authorization
ru: Авторизация по телефону

source: Upload Session
ru: Загрузить сессию

source: Authenticate with your phone number to create a new session.
ru: Авторизуйтесь по номеру телефона, чтобы создать новую сессию.

source: Already have a .session file? Upload it here with your API credentials.
ru: Уже есть файл .session? Загрузите его здесь вместе со своими API учётными данными.

source: Deletion is already in progress in another tab
ru: Удаление уже выполняется в другой вкладке

source: s ago
ru: с назад

source: Operation in Progress
ru: Операция выполняется

source: Delete Telegram Account
ru: Удалить Telegram аккаунт

source: Are you sure you want to delete the account
ru: Вы уверены, что хотите удалить аккаунт

source: This action cannot be undone. All session data and credentials will be permanently removed.
ru: Это действие нельзя отменить. Все данные сессии и учётные данные будут окончательно удалены.

source: Delete Account
ru: Удалить аккаунт

source: Account has been deleted.
ru: Аккаунт удалён.

source: Account Deleted
ru: Аккаунт удалён

source: Failed to delete account:
ru: Не удалось удалить аккаунт:

source: Retry
ru: Повторить

source: What to do:
ru: Что делать:

source: Go to Sessions Page
ru: Перейти на страницу Сессий

source: Analysis for these chats is already in progress. Showing current status...
ru: Анализ этих чатов уже выполняется. Показан текущий статус...

source: Analyzing %(num)s chat...
ru: Анализ %(num)s чата...

source: Starting...
ru: Запуск...

source: Cancel analysis
ru: Отменить анализ

source: chats
ru: чатов

source: Two-Factor Authentication Required
ru: Требуется двухфакторная аутентификация

source: Your account has 2FA enabled. Please enter your password to continue.
ru: В вашем аккаунте включена 2FA. Пожалуйста, введите пароль для продолжения.

source: Session:
ru: Сессия:

source: Enter your Telegram 2FA password
ru: Введите ваш 2FA пароль Telegram

source: 2FA Password
ru: 2FA пароль

source: Your 2FA password
ru: Ваш 2FA пароль

source: Enter the password you set in Telegram Settings > Privacy and Security > Two-Step Verification
ru: Введите пароль, установленный в Telegram Настройки > Конфиденциальность > Двухэтапная аутентификация

source: Complete Authentication
ru: Завершить аутентификацию

source: Note: Your password is sent securely and is never stored.
ru: Примечание: Ваш пароль передаётся безопасно и никогда не сохраняется.

source: Verification code sent!
ru: Код подтверждения отправлен!

source: Please enter the code you received via Telegram.
ru: Пожалуйста, введите код, полученный в Telegram.

source: Code sent to:
ru: Код отправлен на:

source: Enter the verification code sent to your phone
ru: Введите код подтверждения, отправленный на ваш телефон

source: Verification Code
ru: Код подтверждения

source: e.g., 12345
ru: например, 12345

source: Enter the 5-digit code from Telegram
ru: Введите 5-значный код из Telegram

source: Verify Code
ru: Проверить код

source: Note: The code expires in a few minutes. If you didn't receive it, start the process again.
ru: Примечание: Код действителен несколько минут. Если вы не получили его, начните процесс заново.

source: Account Information
ru: Информация об аккаунте

source: Name:
ru: Имя:

source: Phone:
ru: Телефон:

source: User ID:
ru: ID пользователя:

source: Warning: Duplicate Account Detected
ru: Предупреждение: обнаружен дубликат аккаунта

source: This account is already registered in these sessions:
ru: Этот аккаунт уже зарегистрирован в следующих сессиях:

source: Using multiple sessions for the same account may cause conflicts. Consider removing duplicate sessions.
ru: Использование нескольких сессий для одного аккаунта может вызвать конфликты. Рекомендуется удалить дублирующиеся сессии.

source: Create Another Session
ru: Создать другую сессию

source: Go to Sessions
ru: Перейти к сессиям

source: Authentication Failed
ru: Ошибка аутентификации

source: Try Again
ru: Попробовать снова

source: A unique identifier for this Telegram session
ru: Уникальный идентификатор для этой Telegram сессии

source: Session Name
ru: Имя сессии

source: e.g., my_account
ru: например, my_account

source: A unique name to identify this session. Only letters, numbers, underscores, and hyphens allowed.
ru: Уникальное имя для идентификации этой сессии. Допускаются только буквы, цифры, подчёркивания и дефисы.

source: Your Telegram phone number with country code
ru: Ваш номер телефона Telegram с кодом страны

source: Phone Number
ru: Номер телефона

source: Your Telegram phone number with country code (e.g., +1234567890)
ru: Ваш номер телефона Telegram с кодом страны (например, +1234567890)

source: Your Telegram API ID from my.telegram.org
ru: Ваш Telegram API ID с my.telegram.org

source: e.g., 12345678
ru: например, 12345678

source: Numeric ID from my.telegram.org/apps
ru: Числовой ID с my.telegram.org/apps

source: Your Telegram API Hash from my.telegram.org
ru: Ваш Telegram API Hash с my.telegram.org

source: e.g., 0123456789abcdef...
ru: например, 0123456789abcdef...

source: 32-character hex string from my.telegram.org/apps
ru: 32-символьная hex строка с my.telegram.org/apps

source: Select a proxy for this session
ru: Выберите прокси для этой сессии

source: Proxy
ru: Прокси

source: -- Select a proxy --
ru: -- Выберите прокси --

source: unavailable
ru: недоступен

source: A proxy is required for Telegram connection.
ru: Прокси обязателен для подключения к Telegram.

source: Add a proxy first
ru: Сначала добавьте прокси

source: I understand that session files provide complete access to my Telegram account and accept the security risks.
ru: Я понимаю, что файлы сессий предоставляют полный доступ к моему аккаунту Telegram, и принимаю связанные с этим риски безопасности.

source: Send Verification Code
ru: Отправить код подтверждения

source: Try loading chats again
ru: Попробовать загрузить чаты снова

source: Search chats by name or username
ru: Поиск чатов по имени или имени пользователя

source: Filter chats by type (private, group, channel, etc.)
ru: Фильтровать чаты по типу (личные, группы, каналы и т.д.)

source: Select all visible chats
ru: Выбрать все видимые чаты

source: Select All
ru: Выбрать все

source: Deselect all chats
ru: Снять выбор со всех чатов

source: Select None
ru: Не выбрать ничего

source: Remove all active filters
ru: Удалить все активные фильтры

source: 0 of %(total)s chats
ru: 0 из %(total)s чатов

source: %(count)s members
ru: %(count)s участников

source: Load more chats from this session
ru: Загрузить ещё чаты из этой сессии

source: Load More Chats (%(remaining)s remaining)
ru: Загрузить ещё чаты (осталось %(remaining)s)

source: Configure how many messages to analyze from each chat
ru: Настройте количество сообщений для анализа из каждого чата

source: Analysis Settings
ru: Настройки анализа

source: Set the number of recent messages to fetch and analyze
ru: Установите количество последних сообщений для получения и анализа

source: Messages per chat
ru: Сообщений на чат

source: Higher values take longer but provide more comprehensive analysis
ru: Большие значения занимают больше времени, но обеспечивают более полный анализ

source: Number of recent messages to analyze (10-10000)
ru: Количество последних сообщений для анализа (10-10000)

source: Begin analyzing the selected chats
ru: Начать анализ выбранных чатов

source: No Chats Found
ru: Чаты не найдены

source: This Telegram session doesn't have any chats available for analysis. Try selecting a different session or verify that your session has active chats.
ru: В этой сессии Telegram нет доступных для анализа чатов. Попробуйте выбрать другую сессию или проверьте, есть ли в вашей сессии активные чаты.

source: Session file is valid!
ru: Файл сессии корректен!

source: Proceed to configure the session settings.
ru: Перейдите к настройке параметров сессии.

source: Validation failed:
ru: Ошибка валидации:

source: Proxy servers list
ru: Список прокси-серверов

source: Status
ru: Статус

source: Address
ru: Адрес

source: Auth
ru: Авторизация

source: Actions
ru: Действия

source: Working - last checked
ru: Работает — последняя проверка

source: Never
ru: Никогда

source: Working
ru: Работает

source: consecutive failures
ru: последовательных ошибок

source: No ping
ru: Нет пинга

source: Not yet tested
ru: Ещё не протестирован

source: Untested
ru: Не протестирован

source: Authentication required
ru: Требуется аутентификация

source: No authentication
ru: Без аутентификации

source: None
ru: Нет

source: Test proxy connection
ru: Проверить подключение прокси

source: Retest proxy
ru: Перепроверить прокси

source: Test
ru: Тест

source: Edit this proxy
ru: Редактировать этот прокси

source: Edit proxy
ru: Редактировать прокси

source: Edit
ru: Редактировать

source: Delete this proxy
ru: Удалить этот прокси

source: Delete proxy
ru: Удалить прокси

source: No Proxies Configured
ru: Прокси не настроены

source: Add a proxy server to route Telegram connections through it.
ru: Добавьте прокси-сервер для маршрутизации подключений Telegram через него.

source: The selected proxy is currently unavailable. Consider selecting a working proxy.
ru: Выбранный прокси сейчас недоступен. Рассмотрите выбор работающего прокси.

source: Disconnect session
ru: Отключить сессию

source: Disconnect
ru: Отключить

source: Connect session
ru: Подключить сессию

source: Connect
ru: Подключить

source: Connecting...
ru: Подключение...

source: Disconnecting...
ru: Отключение...

source: Retry connection
ru: Повторить подключение

source: Connection error
ru: Ошибка соединения

source: Account banned
ru: Аккаунт заблокирован

source: This account has been banned by Telegram
ru: Этот аккаунт заблокирован Telegram

source: Banned
ru: Заблокирован

source: Not configured
ru: Не настроено

source: Configure session first
ru: Сначала настройте сессию

source: Unknown state
ru: Неизвестное состояние

source: Drop session file here or click to browse
ru: Перетащите файл сессии сюда или нажмите для выбора

source: Drop your .session file here
ru: Перетащите файл .session сюда

source: or click to browse
ru: или нажмите для выбора

source: or
ru: или

source: Choose File
ru: Выбрать файл

source: Clear selected file
ru: Очистить выбранный файл

source: Session file validated successfully!
ru: Файл сессии успешно проверен!

source: Now configure the session settings below.
ru: Теперь настройте параметры сессии ниже.

source: I understand that session files provide complete access to my Telegram account and accept the security risks. I confirm this session was created on a trusted device and will be stored securely.
ru: Я понимаю, что файлы сессий предоставляют полный доступ к моему аккаунту Telegram, и принимаю связанные с этим риски безопасности. Я подтверждаю, что эта сессия создана на доверенном устройстве и будет храниться безопасно.

source: Back
ru: Назад

source: Save Session
ru: Сохранить сессию

source: Invalid file type. Please select a .session file.
ru: Неверный тип файла. Пожалуйста, выберите файл .session.

source: File is too large. Maximum size is 10 MB.
ru: Файл слишком большой. Максимальный размер — 10 МБ.

source: Validating session file...
ru: Проверка файла сессии...

source: Failed to validate session file. Please try again.
ru: Не удалось проверить файл сессии. Пожалуйста, попробуйте снова.

source: Ready
ru: Готово

source: Connected
ru: Подключено

source: Connecting
ru: Подключение

source: Disconnecting
ru: Отключение

source: Flood Wait
ru: Превышен лимит запросов

source: Proxy Error
ru: Ошибка прокси

source: Proxy missing
ru: Прокси отсутствует

source: Please wait
ru: Пожалуйста, подождите

source: Wait...
ru: Подождите...

source: Configure account
ru: Настроить аккаунт

source: Delete account
ru: Удалить аккаунт

source: Account
ru: Аккаунт

source: No Telegram Accounts
ru: Нет Telegram аккаунтов

source: You haven't added any Telegram accounts yet. Click \"Add Account\" above to get started.
ru: Вы ещё не добавили ни одного Telegram аккаунта. Нажмите «Добавить аккаунт» выше, чтобы начать.

source: No session selected
ru: Сессия не выбрана

source: Select a Telegram session from the dropdown above
ru: Выберите Telegram сессию из выпадающего списка выше

source: No chats selected for analysis
ru: Не выбраны чаты для анализа

source: Select at least one chat from the list above by checking the boxes
ru: Выберите хотя бы один чат из списка выше, отметив флажки

source: Message limit must be between 10 and 10000
ru: Лимит сообщений должен быть от 10 до 10000

source: Adjust the 'Messages per chat' setting to a value between 10 and 10000
ru: Установите значение «Сообщений на чат» от 10 до 10000

source: Upload a valid session file from the Sessions page
ru: Загрузите корректный файл сессии со страницы Сессий

source: All selected chats are no longer accessible
ru: Все выбранные чаты больше недоступны

source: The selected chats (IDs: {invalid_list}) may have been deleted or removed from Telegram. Please refresh the chat list and select valid chats.
ru: Выбранные чаты (ID: {invalid_list}) могли быть удалены из Telegram. Пожалуйста, обновите список чатов и выберите корректные чаты.

source: Analysis queue is at capacity ({limit} concurrent tasks).
ru: Очередь анализа заполнена ({limit} одновременных задач).

source: Wait for currently running analyses to complete, or cancel an existing analysis
ru: Дождитесь завершения текущих анализов или отмените существующий анализ

source: Analysis cancelled
ru: Анализ отменён

source: Task timed out
ru: Время выполнения задачи истекло

source: Unknown error
ru: Неизвестная ошибка

source: Invalid task ID format
ru: Неверный формат ID задачи

source: Task not found
ru: Задача не найдена

source: Analysis still in progress
ru: Анализ ещё выполняется

source: Analysis not started
ru: Анализ не запущен

source: Analysis failed
ru: Анализ не удался

source: Analysis timed out
ru: Время анализа истекло

source: Analysis cancelled successfully
ru: Анализ успешно отменён

source: Task force-cancelled successfully
ru: Задача принудительно отменена

source: File too large (max {size} MB)
ru: Файл слишком большой (максимум {size} МБ)

source: File is empty
ru: Файл пуст

source: Parse error: {error}
ru: Ошибка обработки: {error}

source: No valid chat entries found in file
ru: В файле не найдено корректных записей чатов

source: An unexpected error occurred while processing the file. Please try again.
ru: При обработке файла произошла непредвиденная ошибка. Пожалуйста, попробуйте снова.

source: Please enter a Google Sheets URL
ru: Пожалуйста, введите URL Google Sheets

source: Invalid Google Sheets URL
ru: Неверный URL Google Sheets

source: No valid chat entries found in spreadsheet
ru: В таблице не найдено корректных записей чатов

source: An unexpected error occurred while fetching the Google Sheet. Please try again.
ru: При получении Google Sheet произошла непредвиденная ошибка. Пожалуйста, попробуйте снова.

source: List not found or expired
ru: Список не найден или истёк

source: Session is invalid and has been removed. The session may have been revoked, logged out from another device, or the account may be banned or deactivated.
ru: Сессия недействительна и была удалена. Сессия могла быть отозвана, завершена с другого устройства, или аккаунт может быть заблокирован либо деактивирован.

source: Upload a new session file from an active Telegram account
ru: Загрузите новый файл сессии из активного Telegram аккаунта

source: Two-factor authentication (2FA) is required. This session needs re-authorization with your 2FA password.
ru: Требуется двухфакторная аутентификация (2FA). Эта сессия требует повторной авторизации с использованием вашего пароля 2FA.

source: Create a new session file using Telethon or Pyrogram and enter your 2FA password during authentication. See the Upload page for instructions.
ru: Создайте новый файл сессии с помощью Telethon или Pyrogram и введите ваш пароль 2FA при аутентификации. Инструкции см. на странице «Загрузка».

source: Session has expired and requires re-authorization.
ru: Срок действия сессии истёк и требуется повторная авторизация.

source: Create and upload a new session file from your Telegram account. See the Upload page for step-by-step instructions.
ru: Создайте и загрузите новый файл сессии из своего аккаунта Telegram. Пошаговые инструкции см. на странице «Загрузка».

source: Failed to connect to Telegram. Please check your session.
ru: Не удалось подключиться к Telegram. Пожалуйста, проверьте вашу сессию или попробуйте позже.

source: Verify your session file is valid or try uploading a new one
ru: Проверьте, что файл сессии действителен, или попробуйте загрузить новый

source: Session not found
ru: Сессия не найдена

source: Failed to fetch account info
ru: Не удалось получить информацию об аккаунте

source: Session '{name}' already exists
ru: Сессия '{name}' уже существует

source: Invalid session: {error}
ru: Неверная сессия: {error}

source: Invalid config: {error}
ru: Неверная конфигурация: {error}

source: Config validation failed: {error}
ru: Ошибка валидации конфигурации: {error}

source: Failed to save session files. Please try again.
ru: Не удалось сохранить файлы сессии. Пожалуйста, попробуйте снова.

source: Session '{name}' uploaded successfully
ru: Сессия '{name}' успешно загружена

source: An unexpected error occurred during upload. Please try again.
ru: При загрузке произошла непредвиденная ошибка. Пожалуйста, попробуйте снова.

source: An unexpected error occurred during validation.
ru: При валидации произошла непредвиденная ошибка.

source: Invalid API hash format. Must be a 32-character hexadecimal string.
ru: Неверный формат API hash. Должен быть 32-символьной шестнадцатеричной строкой.

source: Invalid phone number format. Must start with + and country code (e.g., +1234567890).
ru: Неверный формат номера телефона. Должен начинаться с + и кода страны (например, +1234567890).

source: Selected proxy not found.
ru: Выбранный прокси не найден.

source: Invalid phone number.
ru: Неверный номер телефона.

source: This phone number is banned by Telegram.
ru: Этот номер телефона заблокирован Telegram.

source: Invalid API ID or API Hash.
ru: Неверный API ID или API Hash.

source: Too many requests. Please wait {seconds} seconds before trying again.
ru: Слишком много запросов. Пожалуйста, подождите {seconds} секунд перед повторной попыткой.

source: Connection timeout. Please check your proxy settings and try again.
ru: Таймаут подключения. Пожалуйста, проверьте настройки прокси и попробуйте снова.

source: Failed to send code: {error}
ru: Не удалось отправить код: {error}

source: Auth session expired or not found. Please start over.
ru: Сессия авторизации истекла или не найдена. Пожалуйста, начните заново.

source: Invalid code format. Please enter the numeric code you received.
ru: Неверный формат кода. Пожалуйста, введите полученный числовой код.

source: Connection lost. Please start over.
ru: Соединение потеряно. Пожалуйста, начните заново.

source: Invalid code. Please check and try again.
ru: Неверный код. Пожалуйста, проверьте и попробуйте снова.

source: Code has expired. Please start over.
ru: Код истёк. Пожалуйста, начните заново.

source: Please enter the verification code.
ru: Пожалуйста, введите код подтверждения.

source: Request timeout. Please try again.
ru: Таймаут запроса. Пожалуйста, попробуйте снова.

source: Failed to verify code: {error}
ru: Не удалось проверить код: {error}

source: Invalid auth state. Please start over.
ru: Неверное состояние авторизации. Пожалуйста, начните заново.

source: Failed to verify password: {error}
ru: Не удалось проверить пароль: {error}

source: Client connection lost. Please start over.
ru: Соединение с клиентом потеряно. Пожалуйста, начните заново.

source: Session '{name}' created successfully!
ru: Сессия '{name}' успешно создана!

source: Failed to save session: {error}
ru: Не удалось сохранить сессию: {error}

source: Selected proxy not found. Please select a valid proxy.
ru: Выбранный прокси не найден. Пожалуйста, выберите корректный прокси.

source: Session '{name}' imported successfully
ru: Сессия '{name}' успешно импортирована

source: An unexpected error occurred during import. Please try again.
ru: При импорте произошла непредвиденная ошибка. Пожалуйста, попробуйте снова.

source: Needs API Credentials
ru: Требуются учётные данные API

source: Needs Verification Code
ru: Требуется код подтверждения
